{
  "Post": [
    {
      "id": 1,
      "title": "Baldur's Gate 3 выйдет в раннем доступе в августе. Игра обзавелась очередным трейлером",
      "image": "v1592286012/news/baldurs_rlw8sa.jpg",
      "long_desc": "\tРазработчики уже определили контент, который выпустят первым делом, однако у них могут возникнуть трудности с разработкой из-за Covid-19, хотя актёры уже возвращаются в студию для захвата движений.\n\tТочную дату не называют из-за неопределённостей, возникших в компании в том числе из-за удалённой работы.\n\tПо словам Свена Винке, графика игры заметно похорошела по сравнению с первой презентацией, а многие механики также с тех пор улучшены. Он считает, что после выхода в ранний доступ игра станет ещё красивее.\n\t18 июня по BG3 проведут очередной стрим с презентацией геймплея."
    },
    {
      "id": 2,
      "title": "Ryzen 3 4300U может работать без охлаждения",
      "image": "v1592286239/news/ryzen_cbamz1.jpg",
      "long_desc": "\tВ таком режиме процессор проходит тесты в Cinebench R15 и 3DMark\n\tПользователь Fritzchens Fitz, известный в кругах ПК-сообщества своими высокодетализированными снимками комплектующих и полупроводниковой продукции, провёл интересный тест: он обнаружил, что четырёхъядерный APU Ryzen 3 4300U может работать вообще без какого-либо (даже пассивного) охлаждения.\n\tВо время теста были сделаны теплоснимки, которые показали, что в таком режиме работает только один из двух CCX-кластеров, то есть два ядра из четырёх. Тем не менее, процессор не только работал без сбоев, но и завершил тестирование в Cinebench R15 и 3DMark TimeSpy c результатами в 124/327 и 395 баллов соответственно. Для сравнения: в нормальных условиях Ryzen 3 4300U набирает в Cinebench R15 140/550 баллов.\n\tЭнергоэффективные мобильные процессоры Ryzen 4000 серии относятся к поколению Renoir. Они изготавливаются по техпроцессу 7нм на архитектуре Zen2."
    },
    {
      "id": 3,
      "title": "В сеть попали первые подробности Star Wars: Squadrons — игра выйдет 2 октября",
      "image": "v1592286415/news/stwrs_g3xcaj.jpg",
      "long_desc": "\tПресс-релиз по ошибке раньше времени опубликовали на IGN.\n\tПервый трейлер игры должны представить в 18:00 по МСК, однако первые подробности попали в сеть до официального анонса. Судя по всему, новость опубликовали на портале IGN, однако ссылку быстро сделали недоступной.\n\tЭкшен от первого лица, где игроки будут управлять космическими истребителями, выйдет на PS4, Xbox One и ПК 2 октября. Причём на ПК игра сразу будет доступна в трёх магазинах — Steam, EGS и Origin.\n\tВ Squadrons будет и одиночная, и многопользовательская кампании — их действие развернётся после событий «Возвращения джедая». Также разработчики из EA Motive Studios обещают кроссплей между всеми платформами и поддержку VR-гарнитур для ПК-версии уже на старте.\n\tПолноценный геймплей представят на EA Play 2020, которая стартует в ночь с 18 на 19 июня в 2:00 по МСК."
    },
    {
      "id": 4,
      "title": "Ролик с дизайном PS5 за четыре дня стал самым залайканным на канале PlayStation",
      "image": "v1592286550/news/ps4_e2n4wh.png",
      "long_desc": "\tПохоже, большинство фанатов одобрило дизайн консоли.\n\tSony показала дизайн PS5 на своей презентации 11 июня, и к 15 числу ролик с ним успел набрать на канале PlayStation свыше 1,1 миллиона лайков. Несмотря на то, что вид консоли вызвал много споров в сети.\n\tСейчас это самое залайканное видео на канале PlayStation с отрывом от других роликов. Например, под первым геймплеем The Last of Us Part II только 495 тысяч лайков, а под анонсом Marvel's Spider-Man — всего 136 тыяч.\n\t1Также видео с дизайном PS5 набрало свыше 22 миллионов просмотров, сразу же поднявшись до топа на канале PlayStation.\n\tДля сравнения, ролик с дизайном Xbox Series X за шесть месяцев набрал 334 тысячи лайков и свыше 12 миллионов просмотров.\n\tРанее в Sony рассказали, что работая над дизайном PS5 в компании хотели создать «нечто смелое и почти вызывающее»."
    },
    {
      "id": 5,
      "title": "Microsoft подробнее объяснила, как работает Smart Delivery — покупка одной игры на двух поколениях консолей",
      "image": "v1592286715/news/micrdelivery_fw3ofh.jpg",
      "long_desc": "\t15 июня в официальном блоге Xbox появилось подробное описание работы технологии Smart Delivery. Она предполагает, что игрок может купить тайтл для Xbox One и продолжить играть в него на Xbox Series X без каких-либо дополнительных усилий.\n\tMicrosoft Store сам выберет нужный вариант игры и загрузит файлы именно для подходящей консоли, а пользователь может быть уверен, что получит самую продвинутую версию из доступных.\n\tSmart Delivery гарантирует, что консоль загрузит лучшую доступную версию игры. А разработчики, поддержавшие эту программу, гарантируют, что патч «следующего поколения» будет бесплатным.\n\tSony свой аналог этой программы пока так и не представила."
    }
  ],
  "Long": [
    {
      "id": 1,
      "body": "some comment",
      "postId": 1
    },
    {
      "id": 2,
      "body": "some comment",
      "postId": 1
    }
  ],
  "profile": {
    "name": "typicode"
  }
}
